[
  {
    "version": "2.1.1.0",
    "date": "24.11.2025",
    "download_url": "https://downloads.peakboard.com/download/PeakboardHub/archive/2.1.1.0/PeakboardHubSetup.exe",
    "tabs": [
      {
        "name": "General overview",
        "content": [
          {
            "type": "headline",
            "text": "Peakboard Boxen"
          },
          {
            "type": "list",
            "list_items": [
              "Das Tag „users“ wurde zu den Box-Protokollfiltern hinzugefügt.",
              "Es wurde die Möglichkeit hinzugefügt, beim Bereitstellen einer Peakboard-Anwendung auf eine Box, upload-definierte Variablen zu setzen.",
              "Funktionalität hinzugefügt, um Änderungen in der Box-Übersicht ohne Neuladen der Seite anzuzeigen.",
              "Informationen über den aktuell angemeldeten Benutzer wurden zu Box-Funktionsaufrufen hinzugefügt.",
              "Die Benutzeroberfläche zur Konfiguration des Zeitservers auf einer Box wurde aktualisiert.",
              "Die Passwort-Richtlinie für Box-Passwörter wurde aktualisiert.",
              "Der Passwortänderungsprozess wurde an Änderungen in Peakboard Runtime angepasst.",
              "Die UI für leere Zustände wurde verbessert, um Benutzer besser zu unterstützen.",
              "Die Geschwindigkeit beim Laden von Boxen in der Box-Übersicht wurde erhöht.",
              "Das Laden von Boxen mit beschädigten Zertifikaten wurde verbessert.",
              "Die Bedienbarkeit der Box-Übersicht wurde verbessert, indem der Zustand von Box-Gruppen gespeichert wird.",
              "Ein Hinweis wurde hinzugefügt, der darauf hinweist, wenn keine Peakboard Runtime Update-Datei verfügbar ist.",
              "Ein Problem wurde behoben, bei dem der Neustart-Button in der Box-Übersicht fehlte.",
              "Ein Problem beim Löschen von Zeilen in Variablenlisten einer Box wurde behoben.",
              "Ein Problem wurde behoben, das das Ausführen von Box-Funktionen verhinderte, wenn Parameter mit Regex-Einschränkungen verwendet wurden.",
              "Falsche Datentypen bei Funktionsaufrufen mit Parametern wurden behoben.",
              "Verschiedene UI-Probleme auf der Box-Detailseite wurden behoben."
            ]
          },
          {
            "type": "headline",
            "text": "Peakboard Hub Listen"
          },
          {
            "type": "list",
            "list_items": [
              "Eine Option wurde hinzugefügt, die leere Werte für Validierungen des Typs String erlaubt.",
              "Funktionalität wurde hinzugefügt, um die Spalten-Validierung automatisch auf Variablen anzuwenden, die über den Bindungsdialog erstellt werden.",
			  "Benutzereinstellungen für Ausgabelisten in Hub Flows wurden hinzugefügt.",
              "Die UI wurde überarbeitet, um die Arbeit mit Listen zu verbessern.",
              "Die Dateistruktur beim Herunterladen von Listendaten als CSV wurde verbessert.",
              "Die Geschwindigkeit beim Laden von Listen auf der Listen-Seite wurde erhöht.",
              "Ein Problem wurde behoben, welches das Anhängen von Daten beim Import von Listendaten verhinderte.",
              "Mehrere kleinere Probleme im Zusammenhang mit der Listenbearbeitung wurden behoben.",
              "Ein Problem wurde behoben, bei dem ausgeblendete Listenspalten nach dem Neuladen der Seite wieder angezeigt wurden.",
              "Probleme wurden behoben, durch welche Listen aufgrund ungültiger Benutzereinstellungen aus älteren Hub-Versionen nicht geladen werden konnten.",
              "Ein Problem wurde behoben, durch welches das Laden von Listendaten über Plain SQL fehlschlagen konnte.",
              "Ein Problem wurde behoben, durch welches leere Zeichenfolgen immer die Regex-Validierung bestanden.",
              "Ein Problem wurde behoben, durch welches die Berechtigung zum Löschen von Zeilen nicht korrekt funktionierte.",
              "Ein Problem wurde behoben, durch welches mehrere Anführungszeichen beim Import zu einem einzigen zusammengeführt wurden."
            ]
          },
          {
            "type": "headline",
            "text": "Peakboard Hub Variablen"
          },
          {
            "type": "list",
            "list_items": [
              "Eine Option wurde hinzugefügt, die leere Werte für Validierungen des Typs String erlaubt.",
              "Die Möglichkeit wurde hinzugefügt, den Datentyp und die Validierungen einer Variable zu ändern.",
              "Funktionalität wurde hinzugefügt, um Änderungen in der Variablenübersicht ohne Neuladen der Seite anzuzeigen.",
              "Die Durchsetzung von Einschränkungen bei Remote-Datenaktualisierungen wurde hinzugefügt, einschließlich Fehlermeldungen für ungültige Werte.",
              "Die UI wurde verbessert, um besser zum Peakboard-Design zu passen.",
              "Ein Problem wurde behoben, das beim Aktualisieren von Werten in String-Variablen auftrat, die an eine Liste gebunden sind."
            ]
          },
          {
            "type": "headline",
            "text": "Dateimanager"
          },
          {
            "type": "list",
            "list_items": [
              "Funktionalität hinzugefügt, um Unterschiede zwischen .pbmx-Dateien in der Versionsübersicht des Dateimanagers anzuzeigen.",
              "Icons wurden für ein besseres Look & Feel verbessert.",
              "Ein Problem wurde behoben, durch welches der Dateimanager in einigen Fällen nicht genutzt werden konnte.",
              "Ein Problem wurde behoben, das beim Überschreiben von bereits existierenden, aber für den Benutzer nicht sichtbaren Dateien auftrat."
            ]
          },
          {
            "type": "headline",
            "text": "Hub Flows"
          },
          {
            "type": "list",
            "list_items": [
              "Ein Problem mit Aggregationsschritten in Hub Flows wurde behoben.",
              "Ein Problem mit RSS-Feeds in Hub Flows wurde behoben."
            ]
          },
          {
            "type": "headline",
            "text": "Users"
          },
          {
            "type": "list",
            "list_items": [
              "Ein Button wurde hinzugefügt, um Benutzereinladungen manuell zu löschen.",
              "Die UI wurde für ein besseres Look & Feel aktualisiert.",
              "Ein Problem wurde behoben, bei dem Benutzergruppen in bestimmten Fällen nicht gelöscht werden konnten.",
              "Das Zugriffsrecht „Screenshot Only“ wurde entfernt, um die Konfiguration von Benutzergruppen zu verbessern."
            ]
          },
          {
            "type": "headline",
            "text": "Settings"
          },
          {
            "type": "list",
            "list_items": [
              "Die Möglichkeit wurde hinzugefügt, eine Peakboard Runtime Update-Datei manuell vom System des Benutzers hochzuladen.",
              "Eine Einstellung wurde hinzugefügt, die Boxen automatisch deaktiviert, wenn sie mit einem Unauthorized-Fehler antworten.",
              "Die UI zum Hinzufügen eines neuen Lizenzschlüssels wurde verbessert."
            ]
          },
          {
            "type": "headline",
            "text": "General"
          },
          {
            "type": "list",
            "list_items": [
              "Die Verschlüsselung sensibler Daten in der Hub-Datenbank wurde verbessert.",
              "Die Positionierung von Meldungsdialogen wurde für bessere Benutzerfreundlichkeit optimiert.",
              "Der Dialog für abgelaufene Lizenzen wurde verbessert."
            ]
          },
          {
            "type": "headline",
            "text": "API"
          },
          {
            "type": "list",
            "list_items": [
              "CSV wurde als Ausgabeformat für Listendaten hinzugefügt."
            ]
          }
        ]
      }
    ]
  }
]
