[
	{
		"version": "3.10",
		"date": "28.10.2024",
		"download_url": "https://peakboard.rocks/download-version-history",
		"box_download_url": "https://peakboard.com/download/Peakboard/archive/3.10.0.0.0/PeakboardRuntime.pbux",
		"designer_download_url": "https://peakboard.com/download/Peakboard/archive/3.10.0.0.0/PeakboardSetup.exe",
		"byod_download_url": "https://peakboard.com/download/Peakboard/archive/3.10.0.0.0/PeakboardRuntimeSetupUI.exe",
		"tabs": [
			{
				"name": "General overview",
				"content": [
					{
						"type": "headline",
						"text": "General"
					},
					{
						"type": "list",
						"list_items": [
							"[Video] The video player now allows live streams.",
							"[Video] The video player now allows YouTube videos.",
							"[Box communication] Allowed updates with warnings even if the version is not newer.",
							"[Box communication] Fixed a bug that prevented exporting Box settings if the box was not available.",
							"[Box communication] Fixed a bug where downloading a PBMX from a cloud-connected box failed.",
							"[Box communication] Fixed a bug that the \"Update from file\" button should not be available for boxes connected via cloud connection.",
							"[Box communication] Fixed a bug where the wrong cloud key could be shown.",
							"[Oracle] Added a publish feature to the Oracle DB Building Block.",
							"[Button] Added the ability to change the size and alignment of icons in buttons.",
							"[Button] Added the option to choose from the icon gallery.",
							"[Button] Fixed a bug where touchscreens sometimes required two clicks for the button, as the first hover state was activated.",
							"[Checkbox] Fixed a bug that caused a white screen when a checkbox was clicked multiple times.",
							"[RSS] Fixed an issue with special RSS feeds.",
							"[Dataflow] Fixed a bug that caused a deadlock when running a Reload and await on a Dataflow, preventing the script from ending.",
							"[Dataflow] Fixed a bug where a column was lost in the Dataflow step during join with selected columns.",
							"[Datepicker] Fixed a bug where a time/date picker connected to a list lost its binding when the list was cleared and refilled with values.",
							"[Datepicker] Fixed a bug where databinding for Data/Value worked only in the property grid but not in the dialog for the Timepicker.",
							"[Datepicker] Fixed an issue where the Timepicker window did not close when changing screens.",
							"[Designer] Added a global event for touchscreen taps.",
							"[Designer] Enabled timer scripts to be enabled/disabled in the context menu, with disabled items appearing grey.",
							"[Designer] Fixed a bug where copy-pasting groups only included controls with the same (15px) offset.",
							"[Designer] Fixed a bug where copying a control removed the name instead of generating a new one.",
							"[Designer] Fixed a bug where copying and pasting a screen with the same name required a new name for it.",
							"[Designer] Fixed a bug where it was not possible to remove a bound variable for title/subtitle; added a trash icon for this purpose.",
							"[Designer] Fixed a bug where Peakboard Designer did not start if there was an error in the settings helper.",
							"[Designer] Fixed a bug where windows size referenced the primary screen instead of the current one.",
							"[Designer] Fixed a bug where YouTube links did not work.",
							"[Designer] Fixed an issue where the language dropdown was not displayed properly.",
							"[Designer] Set screen transition default to \"None\".",
							"[Dropdown] Updated icons.",
							"[Explorer] Fixed a bug where icons from the elements in the script and resource section were blurry.",
							"[Explorer] Updated the \"Text input\" event to have the same name and icon in the explorer as it does in the context menu.",
							"[Font] Fixed a bug where a font used in conditional formatting could be deleted in the font manager.",
							"[Format] Improved the ability to convert negative timespans.",
							"[Group] Allowed sending a screenshot of a group via email.",
							"[Group] Enabled the ability to print a group on the default printer.",
							"[Image] Added appearance options to the image control: Opacity, Stretch, Corner Radius.",
							"[JSON] Fixed a bug where JSON could not be parsed if there was a JSON name containing a space.",
							"[JSON] Fixed a bug where OAuth requests for JSON, XML, CSV, etc. were not sent correctly.",
							"[Peakboard Box] Fixed a bug where a variable was not always saved on the Peakboard Box.",
							"[Peakboard Hub] Fixed a bug where Box Management Synchronize did not work and showed \"Hub is not connected,\".",
							"[Peakbot] Removed due to providing unhelpful responses.",
							"[Power BI] Fixed a bug where the Power BI control was not functioning, with no error message in the log.",
							"[PowerBI] Enabled the ability to set filters and make report settings scriptable.",
							"[PowerBI] Fixed a bug where reopening the control caused the wrong report to be preselected.",
							"[PowerBI] Reworked dialog style.",
							"[Property Grid] Implemented basic numerical operations (+ - x /) in input fields for width/height/x/y.",
							"[Resources] Fixed a bug where an icon was missing.",
							"[Resources] Fixed a bug where changing the source of a PDF or image control with a network resource changed it for all controls using that resource.",
							"[RSS] Fixed a bug where Feed Basic authentication errors occurred in Preview.",
							"[S7] Fixed a bug where an error occurred when saving an S7 to the connections.",
							"[S7] Fixed a bug where writing a string that is shorter than expected by the S7 did not work.",
							"[Script editor] Fixed a bug where global event parameters for KeyPressed event were shown twice.",
							"[Script editor] Fixed a bug where the Save button remained disabled when a building block was removed.",
							"[Script editor] Fixed an issue where duplicating a datasource/dataflow with a refreshed script caused the top section of the snippet tree to remain on the original source.",
							"[Script editor] Fixed an issue where pressing the \"X\" icon in the save dialog did not close just the save dialog but instead closed the whole script editor, causing loss of changes.",
							"[Script editor] Updated functionality so that pressing the \"Save and close\" button does not show the \"Do you want to save your changes?\" dialog.",
							"[Scripting] Allowed the use of '.' in text input events.",
							"[Scripting] Fixed a bug where adding a value for a boolean in Building Block did not initially work correctly.",
							"[Setup] Fixed a bug where choosing a custom path for BYOD installation placed only the uninstaller there.",
							"[Snippets / Building Block] Added an \"Insert Row\" Building Block for Variable Lists.",
							"[Snippets / Building Block] Created a snippet to print the current screenshot on the default printer.",
							"[Snippets / Building Block] Enabled the option to check modifiers (Shift, Control, etc.) for the key pressed event.",
							"[Snippets / Building Block] Fixed a bug where creating a new script in block mode and switching to script mode did not allow saving the script unless changes were made.",
							"[Snippets / Building Block] Fixed a bug where the \"Get index of\" feature did not work for Number columns in data sources and dataflows.",
							"[Snippets / Building Block] Fixed a bug where the \"Insert row\" snippet was not working when a variable list was bound to a Styled List/Tile.",
							"[Snippets / Building Block] Fixed a bug where the Variable List \"Add List\" Block did not trigger a reload event for the variable list.",
							"[Snippets / Building Block] Organized Hub Connection Snippets/Building Block into a subfolder labeled \"Connection\".",
							"[Snippets / Building Block] Provided default sounds alongside custom resource files for play sound functionality.",
							"[Table] Improved performance when dragging a datasource with many columns to only take the first 30 columns.",
							"[Textbox] Fixed a bug where if the background was transparent, the text also became invisible.",
							"[Textbox] Fixed a bug where the Regex example for Date DE did not work correctly.",
							"[Textbox] Fixed an issue where using input text within a styled list required two clicks for the next action e.g. button click.",
							"[Textbox] Updated Regex validation so that invalid border color disappears as soon as the entered value is valid, not just after clicking outside/entering.",
							"[Tile / TileView / ListView] Fixed a bug where binding of title/subtitle did not work.",
							"[Tile / TileView / ListView] Fixed a bug where copying and pasting a styled list containing an image control threw an error, crashing the pasted styled list.",
							"[Tile / TileView / ListView] Fixed a bug where if an input control in a styled list was bound to an element in the styled list's list, the index of the styled list could not be accessed in the script anymore.",
							"[Tile / TileView / ListView] Fixed a bug where input binding of Tile was not working.",
							"[Tile / TileView / ListView] Fixed a problem where updating values in a variable list via the update/replace list script did not update the Tile control.",
							"[Tile / TileView / ListView] Improved scrolling performance for Styled Lists.",
							"[Variable] Prompted the user to add columns as well or just the data in the existing structure."
						]
					}
				]
			}
		]
	}
]