{
	"version": "3.10",
	"date": "28.10.2024",
	"download_url": "https://peakboard.rocks/download-version-history",
	"box_download_url": "https://peakboard.com/download/Peakboard/archive/3.10/PeakboardRuntime.pbux",
	"designer_download_url": "https://peakboard.com/download/Peakboard/archive/3.10/PeakboardSetup.exe",
	"byod_download_url": "https://peakboard.com/download/Peakboard/archive/3.10/PeakboardRuntimeSetupUI.exe",
	"tabs": [
		{
			"name": "General overview",
			"content": [
				{
					"type": "headline",
					"text": "General",
					"list_items": null
				},
				{
					"type": "list",
					"text": null,
					"list_items": [
						"[BB / Snippets] \"Insert Row\" BB for Variable Lists is missing",
						"[Box communication] Allow to update with a warning even if the version is not newer. That allows to reinstall a broken installation",
						"[Box communication] dont allow to export Box settings if box is not available",
						"[Box communication] Downloading a pbmx from a cloud connected box fails",
						"[Box communication] For boxes connected via cloud connection, the \"Update from file\" button should not be there",
						"[Box communication] The wrong cloud key could be shown",
						"[Building Blocks] Add a publish to Oracle DB Building Block",
						"[Button] Add possibility to change the size and alignment of icons in buttons",
						"[Button] Add the possibility to choose from the icon gallery",
						"[Button] On touch screens the button sometimes needs to be clicked twice, as first hover state gets activated",
						"[Checkbox] White screen when a checkbox is clicked several times",
						"[Data source] Fix an issue with special RSS feeds",
						"[Dataflow] Column is lost: Dataflow step join with selected columns",
						"[Dataflow] When running a Reload and await on a dataflow this can lead into a deadlock. So the script will never end",
						"[Datepicker] & Timepicker window does not close when changing screens",
						"[Datepicker] & Timepicker: Databinding for Data/Value works only in the property grid but not in the dialog",
						"[Datepicker] When a time / date picker control is connected to a list and the list gets cleared and refilled with values, the time picker looses its binding",
						"[Designer] Add global event for touchscreen tapped",
						"[Designer] Copy-Pasting groups should paste all controls with the same (15px) offset",
						"[Designer] Don't allow to copy paste a screen with the same name but require a new name for it",
						"[Designer] It's not possible to remove a bound variable for title / subtitle. We should add there the trash icon",
						"[Designer] Language drop down not displayed properly",
						"[Designer] Peakboard Designer is not starting if an error in the settingshelper occures",
						"[Designer] Screen transition should as default be set on \"None\"",
						"[Designer] The video links are currently part of the translation file and hard coded into the source - Move it to a online file like the extensions",
						"[Designer] Timer scripts should also be en- /disabled in context menu and if disabled they should be grey like for datasource",
						"[Designer] When copying a control the name gets removed instead of a new name generated",
						"[Designer] Windowsize references the primary screen not the current one",
						"[Designer] YouTube link not working",
						"[Dropdown] Switch Icons",
						"[Explorer] \"Text input\" event should also be called so in the explorer and have the same icon as it has in the context menu",
						"[Explorer] Icons from the elements in the script and resource section are blury, we should use the icon we provide",
						"[Font] If a font is used in conditional formatting, it can be deleted in the font manager. This should not be possible and we should show the info instead",
						"[Format] We should be able to convert a negative timespan too since orders can be overdue in which case i would expect a - infront of the return",
						"[Group] Allow to print a group on the default printer",
						"[Group] Allow to send a screenshot of a group via mail",
						"[Image] Add appearance options to image control - Opacity, Stretch, Corner Radius",
						"[JSON] , XML, CSV, ... OAuth request not sent correctly",
						"[JSON] Can't parse JSON if there is a JSON Name with space",
						"[Peakboard Box] Variable is not always saved on Peakboard Box (large projects)",
						"[Peakboard Hub] Box Management Synchronize does not work and shows \"Hub is not connected\", even though the Hub connection works in other places (e.g. Hub datasource)",
						"[Peakbot] Remove it because it just gives stupid answers",
						"[Power BI] The Power BI control does not work anymore. Unfortunately, there is no error message in the log. Possibly some changes in the API?",
						"[PowerBI] Allow to set Filters + make the report settings scriptable",
						"[PowerBI] If you reopen the control, the wrong report is preselected.",
						"[PowerBI] Rework dialog style",
						"[Property Grid] We should implement basic numerical operations ( + - x / ) in input fields for width / height / x / y like it is in Adobe / Figma etc.",
						"[Resources] Icon is missing",
						"[Resources] When chaning the source of a pdf or image control with a network resource it changes it for all controls with this resource",
						"[RSS] Feed Basic auth error in Preview",
						"[S7] if you want to write a string that is shorter than expected by the S7 it does not work",
						"[S7] When saving a S7 to the connections an error occures",
						"[Script editor] Global event parameters for KeyPressed is shown twice",
						"[Script editor] Pressing \"X\"-icon in the save dialog should not close the whole script editor (and delete changes) but only close the save dialog and cancel the close event.",
						"[Script editor] Save Button stays disabled, when a building block gets removed.",
						"[Script editor] When duplicating a datasource / dataflow with an refreshed script, the top section of the snippet tree stays on the original source",
						"[Script editor] When pressing \"Save and close\" button, we should not show the \"Do you want to save your changes?\" dialog, as user obviously wants to save...",
						"[Scripting] Allow . in the text input event",
						"[Scripting] When adding a value for a bool in BB it first does not work correctly",
						"[Setup] If you choose a custom Path for BYOD installation only the uninstaller placed there",
						"[Snippets / BB] \"Get index of\" does not work for Number columns of data sources and dataflows.",
						"[Snippets / BB] Create Snippet to print the current screenshot on the default printer",
						"[Snippets / BB] For key pressed event allow to check modifiers (Shift, Control, ...)",
						"[Snippets / BB] for play sound we should deliver some default sounds beside the custom resource files",
						"[Snippets / BB] Hub Connection Snippets / BB should be in a subfolder \"Connection\"",
						"[Snippets / BB] Variable List \"Add List\" Block doesn't trigger reload event of the variable list",
						"[Snippets / BB] When a variable list is bound to a Styled List/Tile the \"Insert row\" snippet is not working",
						"[Snippets / BB] When you create a new script in block mode and you switch to script mode, you can't save the script before you change anything",
						"[Table] When dragging a datasource with a lot of columns, take just the first 30 columns",
						"[Textbox] If Background inside is Transparent, the text is also invisible. Text should still be visible",
						"[Textbox] If you use the input text within a styled list, you have to click twice to do another action e.g button or new input while if you use it outside can be done directly",
						"[Textbox] Regex Example for Date DE ist not working correctly.",
						"[Textbox] Regex validation: Invalid border color should disappear as soon as the entered value is valid and not only after a click outside / enter",
						"[Tile / TileView / ListView] Binding of title / subtitle does not work",
						"[Tile / TileView / ListView] Copy pasting a ListView that contains an image control throws an error and pasted list view is crashed",
						"[Tile / TileView / ListView] If an input control in a ListView is bound to an element in the list of the ListView, the index of the ListView cannot be accessed in the script anymore (see the attached visualization).",
						"[Tile / TileView / ListView] Input Binding of Tile is not working",
						"[Tile / TileView / ListView] Scroll Styled List performance",
						"[Tile / TileView / ListView] Updating values in a variable list via the update / replace list script, doesn't update the Tile control",
						"[Variable] Ask the user to add the columns as well or just the data in the existing structure",
						"[Video] Add property \"Start automatically\" if it is on false the video dont start directly in the Runtime but just when started with script",
						"[Video] Allow to install the vlc player on an external device",
						"[Video] Having a PBMX with multiple screens and a video control on each screen, starting the runtime starts playing all of the videos (or at least their sound). Both for Ressource and (Youtube) stream",
						"[Video] Integrate video player for video streaming into our video control. - Designer",
						"[Video] The loop boolean for videocontrols can not be set via script"
					]
				}
			]
		}
	]
}