[{
	"version": "3.10",
	"date": "28.10.2024",
	"download_url": "https://peakboard.rocks/download-version-history",
	"box_download_url": "https://peakboard.com/download/Peakboard/archive/3.10/PeakboardRuntime.pbux",
	"designer_download_url": "https://peakboard.com/download/Peakboard/archive/3.10/PeakboardSetup.exe",
	"byod_download_url": "https://peakboard.com/download/Peakboard/archive/3.10/PeakboardRuntimeSetupUI.exe",
	"tabs": [
		{
			"name": "General overview",
			"content": [
			{
				"type": "headline",
				"text": "General"
			},
			{
				"type": "list",
				"list_items": [
						"[Box communication] Allowed updating with a warning even if the version is not newer, enabling reinstallation of a broken installation."
						"[Box communication] Disabled exporting Box settings from health check if box is unavailable."
						"[Box communication] Removed \"Update from file\" button for cloud-connected boxes."
						"[Box communication] Fixed issue with downloading a PBMX from a cloud-connected box."
						"[Box communication] Resolved issue of displaying an old cloud key."
						"[Building Blocks] Added Building Block for adding a row into the variable list."
						"[Building Blocks] Introduced Building Block for running SQL queries for Oracle."
						"[Button] Enabled adjustment of icon size and alignment in buttons."
						"[Button] Added option to choose icons from the icon gallery."
						"[Button] Fixed double-click issue on touch screens by resolving first hover state activation."
						"[Checkbox] Resolved white screen issue when checkbox is clicked multiple times."
						"[Data source] Addressed issue with special RSS feeds."
						"[Dataflow] Fixed issue where columns were lost in Dataflow step join with selected columns."
						"[Dataflow] Fixed potential deadlock when running reload and await on a dataflow."
						"[Datepicker] Resolved binding issue when time/date picker control is connected to a list that gets cleared and refilled."
						"[Datepicker & Timepicker] Fixed issue where window would not close when switching screens."
						"[Datepicker & Timepicker] Corrected databinding for Date/Value in dialog."
						"[Designer] Added global touchscreen tap event."
						"[Designer] Implemented consistent (15px) offset for Copy-Pasting groups."
						"[Designer] Restricted screen copy-pasting to enforce unique screen names."
						"[Designer] Added trash icon to remove bound variable for title/subtitle."
						"[Designer] Corrected display of language dropdown."
						"[Designer] Fixed startup error related to settings helper in Peakboard Designer."
						"[Designer] Set screen transition to \"None\" as the default."
						"[Designer] Timer scripts are now enabled/disabled in the context menu and appear greyed out when disabled, similar to datasource."
						"[Designer] Fixed issue where copied control names were removed instead of generating new names."
						"[Designer] Fixed window size reference to respect current screen rather than primary."
						"[Explorer] Updated icons for elements in script and resource sections."
						"[Font] Restricted deletion of fonts used in conditional formatting within the font manager."
						"[Format] Enabled conversion of negative timespan."
						"[Group] Allowed printing of a group on the Windows default printer."
						"[Group] Added ability to send a screenshot of a group via email."
						"[Image] Enhanced image control with Opacity, Stretch, and Corner Radius appearance properties."
						"[JSON, XML, CSV] Fixed oAuth request issues."
						"[JSON] Resolved parsing issue with columns containing spaces."
						"[Peakboard Box] Fixed variable-saving issue on Peakboard Box."
						"[Peakboard Hub] Resolved issue with Box synchronization."
						"[Peakbot] Removed due to unhelpful responses."
						"[Power BI] Added support for setting Filters and scriptable report settings."
						"[Power BI] Updated dialog style."
						"[Power BI] Corrected report selection issue in dialog."
						"[Power BI] Fixed cases where Power BI control became unresponsive."
						"[Property Grid] Implemented basic numerical operations (+, -, x, /) in input fields for width, height, x, and y."
						"[Resources] Resolved missing icon issue."
						"[Resources] Fixed issue with changing network resource source for PDF/image control."
						"[RSS] Resolved Basic auth issue."
						"[S7] Fixed issue with writing shorter-than-expected strings for S7."
						"[S7] Addressed error when saving S7 to connections."
						"[Script editor] Fixed duplicate display of KeyPressed event parameters in global event parameters."
						"[Script editor] Improved close behavior of \"X\" icon in save dialog to only close dialog and cancel close event."
						"[Script editor] Resolved issue where save button remained disabled when building block was removed."
						"[Script editor] Addressed issue where duplicated datasource/dataflow caused snippet tree section to stay on original source."
						"[Script editor] Disabled \"Do you want to save your changes?\" dialog on \"Save and close.\""
						"[Scripting] Enabled '.' in text input event."
						"[Setup] Resolved custom path selection issue for BYOD installation."
						"[Snippets / BB] Fixed \"Get index of\" for Number columns in data sources/dataflows."
						"[Snippets / BB] Fixed initial functionality issue for boolean values in Building Blocks."
						"[Snippets / BB] Created Snippet for printing current screenshot on default printer."
						"[Snippets / BB] Added modifier checks (Shift, Control, etc.) for key pressed events."
						"[Snippets / BB] Provided default sounds for \"play sound\" in addition to custom resources."
						"[Snippets / BB] Placed Hub Connection Snippets/BB in subfolder \"Connection.\""
						"[Snippets / BB] Resolved \"Add List\" block trigger issue in variable list reload event."
						"[Snippets / BB] Fixed issue with \"Insert row\" snippet in variable lists bound to Styled List/Tile."
						"[Snippets / BB] Fixed inability to save new scripts when switching between block and script mode."
						"[Table] Limited column display to first 30 columns when dragging large data sources."
						"[Textbox] Ensured text visibility even with transparent background inside."
						"[Textbox] Corrected action behavior with styled lists requiring double-click for certain actions."
						"[Textbox] Resolved issue with Regex example for Date DE."
						"[Textbox] Ensured invalid border color disappears upon valid input, without requiring outside click."
						"[Tile / TileView / ListView] Corrected title/subtitle binding issues."
						"[Tile / TileView / ListView] Resolved error when copying ListView with image control."
						"[Tile / TileView / ListView] Restored ListView index access in scripts for bound input controls."
						"[Tile / TileView / ListView] Resolved Tile input binding issues."
						"[Tile / TileView / ListView] Improved scroll performance for Styled List."
						"[Tile / TileView / ListView] Fixed variable list update via script to reflect changes in Tile control."
						"[Variable] Prompt user to add columns or data in existing structure."
						"[Video] Added \"Start automatically\" property; video will only start in runtime if set to true."
						"[Video] Enabled VLC player installation on external devices."
						"[Video] Fixed multi-screen video control issue where runtime started all videos simultaneously."
						"[Video] Integrated video streaming player into video control (Designer)."
						"[Video] Enabled loop boolean for video controls via script."
					]
				}
			]
		}
	]
}]