[
  {
    "version": "4.0.0.0",
    "date": "01.01.2025",
    "download_url": "https://peakboard.rocks/download-version-history",
    "box_download_url": "https://downloads.peakboard.com/download/Peakboard/archive/4.0.0.0.0/PeakboardRuntime.pbux",
    "designer_download_url": "https://downloads.peakboard.com/download/Peakboard/archive/4.0.0.0.0/PeakboardSetup.exe",
    "byod_download_url": "https://downloads.peakboard.com/download/Peakboard/archive/4.0.0.0.0/PeakboardRuntimeSetupUI.exe",
    "tabs": [
      {
        "name": "General overview",
        "content": [
          {
            "type": "headline",
            "text": "New Features"
          },
          {
            "type": "list",
            "list_items": [
              "Added update column to menu, including both the data source menu and the dataflow menu, with consistent styling.",
              "Implemented Peakboard Hub as a new resource type.",
              "Enabled the storage and opening of pbmx files in the Peakboard Hub.",
              "Implemented Peakboard Hub files as a source type for data sources like CSV and JSON.",
              "Added the hub flow lists to the Peakboard Hub Lists data source.",
              "Added a right-click option to controls to copy and match style, improving workflow efficiency.",
              "Offered the option of jumping directly to the location of the error in scripts or flows.",
              "Allowed reading of all threads with answers in a channel via a new dropdown selection.",
              "Implemented a new control for toggle functionality, adding a 'Border Size' property."
            ]
          },
          {
            "type": "headline",
            "text": "Enhancements"
          },
          {
            "type": "list",
            "list_items": [
              "Improved data type matching in filters to correspond with the selected column's type.",
              "Added am/pm information to Device/Checktime endpoint.",
              "Updated Teams data source with a better time format for the 'Date' column.",
              "Made default timeframe dynamic using the default time data source for Teams, Calendar, and Outlook.",
              "Implemented drag-and-drop reordering for elements in the template explorer.",
              "Enhanced error messages for Teams data source when 'Retrieve message from' is not selected.",
              "Improved support for sending subjects (headers) with the Teams Snippet in Building Blocks.",
              "Enabled adding a date data source by default in new projects.",
              "Added sorting and max rows capability."
            ]
          },
          {
            "type": "headline",
            "text": "User Experience"
          },
          {
            "type": "list",
            "list_items": [
              "Improved the Box Management dialog with lazy loading to enhance performance.",
              "Enhanced the design of the Backstage area.",
              "Positioned Hub Dialog correctly to avoid obscured buttons."
            ]
          },
          {
            "type": "headline",
            "text": "Bug Fixes"
          },
          {
            "type": "list",
            "list_items": [
              "Fixed an issue where characters were lost during the Scan Process, particularly for uppercase and special characters.",
              "Resolved an issue with PBFX files not opening correctly with Peakboard Designer.",
              "Addressed a problem with the inability to add more than four OR conditions within the filter.",
              "Corrected a bug where data source deletion did not function if a dataflow depended on it.",
              "Fixed issues with the context menu in dataflow cells causing fatal errors.",
              "Addressed discrepancies in timestamps for Teams/Outlook data sources.",
              "Resolved blurry appearance of template files.",
              "Enhanced control resizing via code to a pure XAML solution.",
              "Addressed checkbox and radio button padding and scaling issues."
            ]
          }
        ]
      }
    ]
  }
]