[{
  "version": "3.0.0.0",
  "date": "12.12.2022",
  "download_url": "https://peakboard.rocks/download-version-history",
  "box_download_url": "https://peakboard.com/download/Peakboard/archive/3.0.0.0.0/PeakboardRuntime.pbux",
  "designer_download_url": "https://peakboard.com/download/Peakboard/archive/3.0.0.0.0/PeakboardSetup.exe",
  "tabs": [
    {
      "name": "Neuanordnung Dataflows",
      "content": [{
        "type": "image",
        "image": "3-0-0-0-Dataflows_de.gif",
        "description": "Die Dataflows haben einen neuen Platz gefunden, um dir den Überblick zu erleichtern. Du findest sie bei der zugehörigen Datenquelle oder der zugehörigen Variablen-Liste anstatt wie bisher in einem eigenen Ordner."
      }]
    },
	  {
      "name": "Neugestaltung Menüleiste",
      "content": [{
        "type": "image",
        "image": "3-0-0-0-Menu_de.gif",
        "description": "Ein weiterer Schritt für mehr Überblick und schnellere Workflows ist die überarbeitete Menüleiste. Du findest alles Nötige übersichtlich in einer schlichten Menüleiste ohne Tabs. Die Option die Ausrichtungshilfe anzupassen findest du nun im Rechtsklick-Menü auf der Arbeitsfläche."
      }]
    },
	  {
      "name": "Gruppierung",
      "content": [{
        "type": "image",
        "image": "3-0-0-0-Grouping_de.gif",
        "description": "Die Funktionen für die Gruppierung wurden erweitert und die Bedienung verbessert. Die gruppierten Controls werden übersichtlich als Ordner angezeigt. Du kannst Gruppen innerhalb von Gruppen erstellen, Namen für die Ordner vergeben und alles ist intuitiv per Drag-and-Drop steuerbar. Per Doppelklick kannst du eine Gruppe tiefer gehen. Hälst du die Strg-Taste gedrückt, kannst du direkt ein Control innerhalb einer Gruppe auswählen."
      }]
    },
	  {
      "name": "Peakboard Edge Revision",
      "content": [{
        "type": "image",
        "image": "3-0-0-0-Edge_de.gif",
        "description": "Sowohl der Peakboard Edge Management-Dialog als auch der zugehörige Datenquellen-Dialog wurde umfassend überarbeitet. Es ist jetzt außerdem möglich mehrere Peakboard Edge Datenquellen anzulegen."
      }]
    },
	  {
      "name": "Neues Raster-Layout",
      "content": [{
        "type": "image",
        "image": "3-0-0-0-Grid_de.gif",
        "description": "Das Ausrichtungs-Raster wurde umfassend überarbeitet. Während du ein Element auf der Arbeitsfläche verschiebst oder dessen Größe änderst, wird dir im Hintergrund das Raster angezeigt. Du erkennst auf einen Blick an welcher Stelle das Control abgelegt wird, wenn du es loslässt. Voraussetzung dafür ist, dass [Am Raster ausrichten] aktiviert ist. Du kannst die Funktion entweder in den Attributen oder per Rechtsklick auf die Arbeitsfläche auch vollständig deaktivieren oder wieder aktivieren."
      }]
    },
	  {
      "name": "Gesamtübersicht",
      "content": [{
		    "type": "headline",
        "text": "Allgemein"
      }, {
        "type": "list",
        "list_items": [
          "[Peakboard Designer Setup] – Versionshistorie wird nach erfolgreichem Setup des Peakboard Designer im Browser geöffnet",
          "[Peakboard Designer] – Fix für einen Fehler, bei dem hinzugefügte Controls auf einer bestehenden Arbeitsfläche beibehalten wurden, wenn man eine neue Datei erstellt hat",
          "[Peakboard Designer] – Fix für einen Fehler, bei dem die Frequenz der WLAN-Netzwerke in den Peakboard Box Einstellungen in kHz statt in GHz angezeigt wurde",
          "[Peakboard Designer] – Fix für einen Fehler, bei dem manche Dialoge aufgrund bestimmter Auflösungs-Einstellungen nicht optimal geöffnet wurden",
          "[Peakboard Designer] – Namen von Datenquellen und Variablen-Listen kann geändert werden, auch wenn dieser in einem Dataflow genutzt wird. Die Quelle im Dataflow wird automatisch angepasst",
          "[Peakboard Designer] – Funktion [Am Raster ausrichten] verbessert, siehe Highlights",
          "[Peakboard Designer] – [Am Raster ausrichten] kann im Template-Editor deaktiviert werden und das Raster mit der Taste [g] angezeigt werden",
          "[Peakboard Designer] – Neue Funktion zur schnellen Erstellung einer neuen Schriftart als Alternative zu [Schriftart anpassen] im Schriftarten-Dialog hinzugefügt",
          "[Peakboard Designer] – UX-Verbesserung im Peakboard Box hinzufügen-Dialog",
          "[Peakboard Designer] – Das Design des Vorschau-Tabs wurde überarbeitet"
        ]
      }, {
		    "type": "headline",
        "text": "Datenquellen"
      }, {
        "type": "list",
        "list_items": [
          "[Peakboard Edge] – Fix für einen Fehler, der durch einen falschen Hostnamen bei DNS-Problemen ausgelöst wurde",
          "[Drag&Drop-Menü] – Fehlerhafte und fehlende Übersetzungen ergänzt"
        ]
      }, {
        "type": "headline",
        "text": "Dataflows"
      }, {
        "type": "list",
        "list_items": [
          "Dataflows umgestaltet, siehe Highlights"
        ]
      }, {
        "type": "headline",
        "text": "Controls"
      }, {
        "type": "list",
        "list_items": [
          "Fix für einen Fehler, bei dem manche Control-Cursor nicht richtig dargestellt wurden",
          "Anordnung der genutzten Controls im Explorer angepasst (neuste Controls oben)",
          "Allgemeine Performance-Verbesserung für Controls",
          "Fehlerhafte Übersetzungen korrigiert"            
        ]
      }, {
		    "type": "headline",
        "text": "Scripting"
      }, {
        "type": "list",
        "list_items": [
          "Fix für einen Fehler, bei dem bei Styled List und Styled Tile Kollektion ein Snippet an falscher Stelle angezeigt hatten"              
        ]
      }, {
        "type": "headline",
        "text": "Administration"
      }, {
        "type": "list",
        "list_items": [
          "Fix für einen Fehler, bei dem es nicht mehr funktioniert hat Peakboard Hub oder Visualisierungs-Zertifikate zum Zertifikat-Speicher einer Peakboard Box hinzuzufügen",
          "Fix für einen Fehler, bei dem das Update alter Boxen mit zu wenig Arbeitsspeicher fehlschlug",         
          "Möglichkeit zur Änderung des Tastaturlayouts auf der Peakboard Box in den Peakboard Box Einstellungen implementiert"
        ]
      }, {
		    "type": "headline",
        "text": "Peakboard Hub"
      }, {
        "type": "list",
        "list_items": [
          "Fix für einen Fehler, bei dem kein Ergebnis angezeigt wurde, wenn man einen Filter angelegt hat, der auf eine Variable in einer Peakboard Hub Datenquelle verlinkt hat"
        ]
      }, {
        "type": "headline",
        "text": "Peakboard Web Access"
      }, {
        "type": "list",
        "list_items": [
          "Fix für einen Fehler, bei dem die Ausführung einer Funktion mit eingeschränkten Parametern nicht richtig funktioniert hat"
        ]
      }]
    }
  ]
}]