[
	{
		"version": "3.10.0.0",
		"date": "28.10.2024",
		"download_url": "https://peakboard.rocks/download-version-history",
		"box_download_url": "https://peakboard.com/download/Peakboard/archive/3.10.0.0.0/PeakboardRuntime.pbux",
		"designer_download_url": "https://peakboard.com/download/Peakboard/archive/3.10.0.0.0/PeakboardSetup.exe",
		"byod_download_url": "https://peakboard.com/download/Peakboard/archive/3.10.0.0.0/PeakboardRuntimeSetupUI.exe",
		"tabs": [
			{
			  "name": "Script Templates",
			  "content": [{
				"type": "image",
				"image": "3-10-0-0-templates_de.gif",
				"description": "Die Script templates wurden grundlegend überarbeitet."
			  }]
			},
			{
			  "name": "Button Icons",
			  "content": [{
				"type": "image",
				"image": "3-10-0-0-button_de.gif",
				"description": "Die Buttons erlauben dir nun auf unsere Icon Galerie zuzugreifen."
			  }]
			},
			{
			  "name": "Video Streams",
			  "content": [{
				"type": "image",
				"image": "3-10-0-0-stream_de.gif",
				"description": "Das Video Control ermöglicht nun den Zugriff auf Video Streams und Youtube Videos."
			  }]
			},
			{
				"name": "General overview",
				"content": [
					{
						"type": "headline",
						"text": "General"
					},
					{
						"type": "list",
						"list_items": [
						
							"[Video] Der Videoplayer erlaubt nun Livestreams.",
							"[Video] Der Videoplayer erlaubt nun Youtube Videos.",
							"[Box communication] Aktualisierungen mit Warnungen werden auch dann zugelassen, wenn die Version nicht neuer ist.",
							"[Box communication] Ein Fehler wurde behoben, bei dem das Herunterladen eines PBMX von einer cloudverbundenen Box fehlschlug.",
							"[Box communication] Ein Fehler wurde behoben, bei dem der falsche Cloud-Schlüssel angezeigt werden konnte.",
							"[Box communication] Ein Fehler wurde behoben, bei dem die Option \"Aus Datei aktualisieren\" fälschlicherweise sichtbar war.",
							"[Box communication] Ein Fehler wurde behoben, der das Exportieren der Boxeinstellungen verhinderte, wenn die Box nicht verfügbar war.",
							"[Button] Die Möglichkeit wurde hinzugefügt, die Größe und Ausrichtung von Icons in zu ändern.",
							"[Button] Die Option wurde hinzugefügt, aus der Icongalerie auszuwählen.",
							"[Button] Ein Fehler wurde behoben, bei dem Touchscreens manchmal zwei Klicks für die einen Button benötigten, da der erste Hover-Zustand aktiviert wurde.",
							"[Checkbox] Ein Fehler wurde behoben, der zu einem weißen Bildschirm führte, wenn eine Checkbox mehrmals geklickt wurde.",
							"[RSS] Ein Problem mit speziellen RSS-Feeds wurde behoben.",
							"[Dataflow] Ein Fehler wurde behoben, bei dem eine Spalte im Dataflow-Schritt beim Join mit ausgewählten Spalten verloren ging.",
							"[Dataflow] Ein Fehler wurde behoben, der zu einem Deadlock führte, wenn ein Reload ausgeführt und auf einen Dataflow gewartet wurde.",
							"[Datepicker] Ein Fehler wurde behoben, bei dem die Datenbindung nicht im Dialog für setzbar war.",
							"[Datepicker] Ein Fehler wurde behoben, bei dem ein Zeit-/Datumsauswähler, der an eine Liste gebunden war, seine Bindung verlor.",
							"[Datepicker] Ein Problem wurde behoben, bei dem der Datepicker beim Wechseln der Bildschirme nicht geschlossen wurde.",
							"[Designer] Die Bildschirmanimation wurde standardmäßig deaktiviert.",
							"[Designer] Ein Fehler wurde behoben, bei dem das Kopieren eines Steuerelements den Namen entfernte, anstatt einen neuen zu generieren.",
							"[Designer] Ein Fehler wurde behoben, bei dem das Kopieren und Einfügen eines Bildschirms mit demselben Namen einen neuen Namen erforderte.",
							"[Designer] Ein Fehler wurde behoben, bei dem das Kopieren und Einfügen von Gruppen nur Steuerelemente mit demselben (15px) Versatz enthielt.",
							"[Designer] Ein Fehler wurde behoben, bei dem der Peakboard Designer nicht gestartet wurde.",
							"[Designer] Ein Fehler wurde behoben, bei dem die Fenstergröße auf den primären Bildschirm anstelle des aktuellen verwiesen wurde.",
							"[Designer] Ein Fehler wurde behoben, bei dem es nicht möglich war, eine gebundene Variable für den Titel/Untertitel zu entfernen; ein Papierkorb-Button wurde zu diesem Zweck hinzugefügt.",
							"[Designer] Ein Fehler wurde behoben, bei dem YouTube-Links nicht funktionierten.",
							"[Designer] Ein globales Event für Touchscreen-Tipps wurde hinzugefügt.",
							"[Designer] Ein Problem wurde behoben, bei dem das Sprachdropdown nicht richtig angezeigt wurde.",
							"[Designer] Timer-Skripte können nun im Kontextmenü aktiviert/deaktiviert werden, wobei deaktivierte Elemente grau angezeigt werden.",
							"[Dropdown] Die Icons wurden aktualisiert.",
							"[Explorer] Das \"Textinput\"-Event wurde aktualisiert, um im Explorer denselben Namen und das gleiche Symbol wie im Kontextmenü zu haben.",
							"[Explorer] Ein Fehler wurde behoben, bei dem die Symbole der Elemente im Skript- und Ressourcenteil verschwommen waren;",
							"[Font] Ein Fehler wurde behoben, bei dem eine in der bedingten Formatierung verwendete Schriftart im Schriftartenmanager gelöscht werden konnte.",
							"[Format] Es ist nun möglich negative Zeitspannen anzuzeigen.",
							"[Group] Das Versenden eines Screenshots einer Gruppe per E-Mail wurde implementiert.",
							"[Group] Es gibt nun die Möglichkeit, eine Gruppe auf dem Standarddrucker zu drucken.",
							"[Image] Visuelle Einstellungen für das Bildsteuerungselement hinzugefügt: Transparenz, Dehnen, Randradius.",
							"[JSON] Ein Fehler wurde behoben, bei dem JSON nicht geparst werden konnte, wenn der JSON-Name ein Leerzeichen enthielt.",
							"[JSON] Ein Fehler wurde behoben, bei dem OAuth-Anfragen für JSON, XML, CSV usw. nicht korrekt gesendet wurden.",
							"[Peakboard Box] Ein Fehler wurde behoben, bei dem Variablen auf der Peakboard Box nicht immer gespeichert wurde.",
							"[Peakboard Hub] Ein Fehler wurde behoben, bei dem die Synchronisation der Boxverwaltung nicht funktionierte und \"Hub ist nicht verbunden\" angezeigt wurde, obwohl die Hub-Verbindung an anderer Stelle funktionierte.",
							"[Peakbot] Entfernt aufgrund unhilfreicher Antworten.",
							"[Power BI] Der Dialogstil wurde überarbeitet.",
							"[Power BI] Die Möglichkeit wurde aktiviert, Filter zu setzen und Berichtseinstellungen skriptfähig zu machen.",
							"[Power BI] Ein Fehler wurde behoben, bei dem das erneute Öffnen des Dialogs dazu führte, dass der falsche Bericht vorausgewählt war.",
							"[Property Grid] Grundlegende mathematische Operationen (+ - x /) in Eingabefeldern für Breite/Höhe/x/y implementiert.",
							"[Resources] Ein Fehler wurde behoben, bei dem das Ändern der Quelle eines PDF- oder Bildcontrols mit einer Netzwerkressource es für alle Controls, die diese Ressource verwenden, änderte.",
							"[Resources] Ein Fehler wurde behoben, bei dem ein Icon fehlte.",
							"[RSS] Ein Fehler wurde behoben, bei dem Feed-Basicauthentifizierungsfehler in der Vorschau auftraten.",
							"[S7] Ein Fehler wurde behoben, bei dem das Schreiben eines kürzeren Strings als vom S7 erwartet nicht funktionierte.",
							"[S7] Ein Fehler wurde behoben, bei dem ein Fehler beim Öffnen einer S7 Verbidung auftrat.",
							"[Script editor] Die Funktionalität wurde aktualisiert, sodass das Drücken des Buttons \"Speichern und schließen\" den Dialog \"Möchten Sie Ihre Änderungen speichern?\" nicht anzeigt.",
							"[Script editor] Ein Fehler wurde behoben, bei dem die globalen Eventparameter für KeyPressed doppelt angezeigt wurden.",
							"[Script editor] Ein Fehler wurde behoben, bei dem die Schaltfläche \"Speichern\" deaktiviert blieb, wenn ein Building Block entfernt wurde.",
							"[Script editor] Ein Problem wurde behoben, bei dem das Drücken des \"X\"-Symbols im Speicherdialog nicht nur den Speicherdialog schloss, sondern stattdessen den gesamten Skripteditor schloss.",
							"[Script editor] Ein Problem wurde behoben, bei dem das Duplizieren einer Datenquelle/Datenfluss mit einem aktualisierten Skript dazu führte, dass der obere Abschnitt des Snippet-Baums an der ursprünglichen Quelle hängen blieb.",
							"[Scripting] Die Verwendung von '.' in Text Eingabeevent wurde zugelassen.",
							"[Scripting] Ein Fehler wurde behoben, bei dem das Hinzufügen eines Wertes für einen Booleschen Wert in Building Blocks zuerst nicht korrekt funktionierte.",
							"[Setup] Ein Fehler wurde behoben, bei dem die Auswahl eines benutzerdefinierten Pfades für die BYOD-Installation nur das Deinstallationsprogramm dort ablegte.",
							"[Oracle] Ein Block für SQL Befehle einer Oracle Datenbank wurde hinzugefügt.",
							"[Snippets / Building Blocks] Ein \"Zeile einfügen\"-Block für Variablenlisten hinzugefügt.",
							"[Snippets / Building Blocks] Die Option hinzugefügt, Modifikatoren (Shift, Control usw.) für das Tastendruckereignis zu überprüfen.",
							"[Snippets / Building Blocks] Ein Fehler wurde behoben, bei dem das Erstellen eines neuen Skripts im Blockmodus und der Wechsel in den Skriptmodus das Speichern des Skripts nicht erlaubte.",
							"[Snippets / Building Blocks] Ein Fehler wurde behoben, bei dem das Snippet \"Zeile einfügen\" nicht funktionierte, wenn eine Variablenliste an eine styled Liste/Tile gebunden war.",
							"[Snippets / Building Blocks] Ein Fehler wurde behoben, bei dem der Block \"Variable List 'Add List'\" kein Reload-Event für die Variablenliste auslöste.",
							"[Snippets / Building Blocks] Ein Fehler wurde behoben, bei dem die Funktion \"Index abrufen\" nicht für Spalten vom Typ Nummer in Datenquellen und Dataflows funktionierte.",
							"[Snippets / Building Blocks] Ein Snippet zum Drucken des aktuellen Screenshots auf dem Standarddrucker wurde erstellt.",
							"[Snippets / Building Blocks] Standard-Töne neben benutzerdefinierten Ressourcendateien für die Soundwiedergabefunktionalität bereitgestellt.",
							"[Table] Die Performance beim Ziehen einer Datenquelle mit vielen Spalten wurde verbessert.",
							"[Textbox] Die Regex-Validierung wurde aktualisiert, sodass die ungültige Rahmenfarbe verschwindet, sobald der eingegebene Wert gültig ist, und nicht nur nach dem Klicken außerhalb/Drücken der Eingabetaste.",
							"[Textbox] Ein Fehler wurde behoben, bei dem das Regex-Beispiel für Datum DE nicht korrekt funktionierte.",
							"[Textbox] Ein Fehler wurde behoben, bei dem der Text unsichtbar wurde, wenn der Hintergrund transparent war.",
							"[Textbox] Ein Problem wurde behoben, bei dem die Verwendung von Eingabetext in einer styled Liste zwei Klicks für die nächste Aktion wie ein Buttonklick nötig waren.",
							"[Tile / TileView / ListView] Die Scrollleistung für styled Listen wurde verbessert.",
							"[Tile / TileView / ListView] Ein Fehler wurde behoben, bei dem das Kopieren und Einfügen einer styled List, die ein Bildsteuerelement enthielt, einen Fehler auslöste und die eingefügte ListView abstürzte.",
							"[Tile / TileView / ListView] Ein Fehler wurde behoben, bei dem die Bindung von Titel/Untertitel nicht funktionierte.",
							"[Tile / TileView / ListView] Ein Fehler wurde behoben, bei dem die Eingabeverknüpfung von Tile nicht funktionierte.",
							"[Tile / TileView / ListView] Ein Problem wurde behoben, bei dem das Aktualisieren von Werten in einer Variablenliste über das Aktualisieren/Ersetzen der Listenskripts die Tile-Steuerung nicht aktualisierte.",
							"[Variable] Der Benutzer wurde aufgefordert, auch Spalten hinzuzufügen oder nur die Daten in der vorhandenen Struktur.",
							
						]
					}
				]
			}
		]
	}
]